# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
na = np.random.randint(1, high=4, size=100)
nb = np.random.randint(1, high=3, size=100)
nc = np.random.randint(10000, high=30000, size=100)

In [4]:
a = pd.Series(na)
b = pd.Series(nb)
c = pd.Series(nc)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [15]:
df_obj = {'a': a, 'b': b, 'c': c}
df = pd.DataFrame(data=df_obj)
df.head()

   a  b      c
0  1  1  16159
1  3  1  10193
2  1  1  19426
3  1  2  28478
4  1  2  27583

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [20]:
df.rename(columns={'a':'bedrs', 'b':'bathrs','c':'price_sqr_meter'}, inplace=True)

In [21]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            16159
1      3       1            10193
2      1       1            19426
3      1       2            28478
4      1       2            27583

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [25]:
oneCol = df['bathrs']+df['bedrs']+df['price_sqr_meter']
print(oneCol)

0     16161
1     10197
2     19428
3     28481
4     27586
5     21619
6     23582
7     19819
8     11119
9     25738
10    27319
11    27022
12    10778
13    22926
14    20404
15    12632
16    20988
17    22880
18    10632
19    23786
20    10937
21    23674
22    21072
23    26136
24    11507
25    18287
26    10028
27    28753
28    14735
29    22011
      ...
70    10288
71    29760
72    24817
73    20353
74    28996
75    11695
76    17405
77    16379
78    25294
79    13285
80    11569
81    24531
82    23412
83    29347
84    18328
85    10501
86    24669
87    20345
88    26052
89    24813
90    13057
91    29145
92    21648
93    13355
94    12456
95    22054
96    24803
97    28823
98    10027
99    23253
Length: 100, dtype: int64

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [23]:
# Yes

### Step 7. Reindex the DataFrame so it goes from 0 to 299